## 
## Cadence bgx_shell "v5.14-s107 (Aug  4 2004 12:54:44)"
## Tue Dec 25 03:55:06 2007
## 
## sdc_write_unambiguous_names global on
## 
set sdc_version 1.4

create_clock  -name vclk -period 10 -waveform {0 5}
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[5]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[5]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[10]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[10]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {b[1]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {b[1]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[6]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[6]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[11]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[11]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {b[2]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {b[2]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[7]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[7]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[12]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[12]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {b[3]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {b[3]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[8]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[8]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[13]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[13]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {b[4]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {b[4]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {a[0]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {a[0]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[9]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[9]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[14]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[14]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {b[5]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {b[5]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {a[1]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {a[1]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[15]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[15]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {b[6]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {b[6]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {a[2]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {a[2]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {b[7]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {b[7]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {a[3]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {a[3]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {a[4]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {a[4]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[0]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[0]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {a[5]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {a[5]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[1]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[1]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {a[6]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {a[6]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[2]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[2]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {a[7]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {a[7]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[3]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[3]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {c[4]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {c[4]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {b[0]}]
set_driving_cell -lib_cell INVX1 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {b[0]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[2]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {a[1]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[0]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {b[7]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {b[5]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {b[3]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {b[1]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[9]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[14]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[7]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[12]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {a[6]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[5]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[10]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {a[4]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[3]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {a[2]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[1]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {a[0]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {b[6]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {b[4]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {b[2]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[15]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {b[0]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[8]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[13]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {a[7]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[6]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[11]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {a[5]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {c[4]}]
set_input_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {a[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[9]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[7]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[5]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[15]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[13]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[11]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[8]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[6]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[4]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[16]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[14]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[12]}]
set_output_delay -add_delay 0 -clock [get_clocks {vclk}] [get_ports {result[10]}]
